import { Film } from './film.model';

export const FILMS: Film[] = [
  {
    id: 0,
    title: 'Начало',
    year: 2010,
    type: false,
    genres: [
      'Трилер',
      'Боевик',
      'Драма',
      'Фантастика'
    ],
    director: {
      id: 1,
      name: 'Кристофер',
      surname: 'Нолан'
    },
    // tslint:disable-next-line:max-line-length
    description: 'Кобб — талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил. '
  },
  {
    id: 1,
    title: 'Начало',
    year: 2010,
    type: false,
    genres: [
      'Трилер',
      'Боевик',
      'Драма',
      'Фантастика'
    ],
    director: {
      id: 1,
      name: 'Кристофер',
      surname: 'Нолан'
    },
    // tslint:disable-next-line:max-line-length
    description: 'Кобб — талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил. '
  },
  {
    id: 2,
    title: 'Начало',
    year: 2010,
    type: false,
    genres: [
      'Трилер',
      'Боевик',
      'Драма',
      'Фантастика'
    ],
    director: {
      id: 1,
      name: 'Кристофер',
      surname: 'Нолан'
    },
    // tslint:disable-next-line:max-line-length
    description: 'Кобб — талантливый вор, лучший из лучших в опасном искусстве извлечения: он крадет ценные секреты из глубин подсознания во время сна, когда человеческий разум наиболее уязвим. Редкие способности Кобба сделали его ценным игроком в привычном к предательству мире промышленного шпионажа, но они же превратили его в извечного беглеца и лишили всего, что он когда-либо любил. '
  },
];
